import { Lecture } from "../../../types";

const description = `
Біз компьютер тек нөлдер мен бірліктерді ғана түсінетінін, ал оның
жадын қосқыштары бар өте ұзын шамдар тізбегі ретінде елестетуге болатынын анықтадық.
Компьютерде сандарды қалай көрсетуге болатынын түсіндік. Ал қалған
ақпаратпен не істеу керек? Әріптермен, суреттермен?
`;

const content = `
# CS50 — 0 деңгей — 4-дәріс  
**ASCII (қосымша материалдар)**  
[Дәріске сілтеме](https://javarush.com/quests/lectures/questharvardcs50.level00.lecture04)

Біз компьютер тек нөлдер мен бірліктерді ғана түсінетінін, ал оның жадын қосқыштары бар өте ұзын шамдар тізбегі ретінде елестетуге болатынын анықтадық. Компьютерде сандарды қалай көрсетуге болатынын түсіндік. Ал қалған ақпаратпен не істеу керек? Әріптермен, суреттермен? Мысалы, ағылшын әліпбиінде 26 әріп бар. Теориялық тұрғыдан әріптерді 0-ден 25-ке дейінгі сандармен, тек екілік жүйеде көрсете аламыз. Бірақ басқа сұрақ туындайды: алдымызда кіші әріп пе, әлде бас әріп пе, оны қалай анықтаймыз? Тыныс белгілері ше? Бос орын сияқты «көрінбейтін» таңбалармен не істеу керек? Қысқасы, таңбаларды сандармен байланыстыратын кодтау жүйесі қажет.

1960-жылдары таңбаларды кодтайтын көптеген әртүрлі сұлбалар болды. Бірізділіктің болмауы тез арада күрделі мәселеге айналды, сондықтан 1963 жылы ANSI Америкалық стандарттау институты **ASCII (American Standard Code for Information Interchange)** кодтау сұлбасын әзірлеп, қолданысқа енгізді. ASCII — таңбаларға сандық кодтар сәйкестендірілген кесте. Әрбір ASCII таңбасы жеті разрядтан немесе жеті биттен тұрады, олардың әрқайсысы 0 немесе 1 мәнін қабылдай алады. 7 бит арқылы екілік жүйеде 0-ден 127-ге дейінгі сандарды, яғни таңбаларды кодтау үшін 128 санды орналастыруға болады.

Есептеп көрейік:  
- a-z — 26 нұсқа  
- A-Z — тағы 26  
- 0-9 — 10  
- тыныс белгілері — 32  
- бос орын — 1  

Барлығы — 95 таңба. Қалған 33 (128 − 95) бос нұсқа **жолды ауыстыру** немесе **каретканы қайтару** сияқты басқарушы таңбалар үшін пайдаланылады.

0-9 таңбаларын және 0-9 сандық мәндерін ажырата білу маңызды. 0-9 таңбалары ASCII кестесінде **48–57** мәндерімен ұсынылған. Қызықты жайт, осы ASCII мәндерінің ең оң жақтағы төрт биті 0-9 сандық мәндерінің екілік көріністерін береді. Бұл ASCII мәндері мен олардың нақты сандық мәндері арасындағы түрлендіруді біршама жеңілдетеді.
`;

export const lecture_00_04: Lecture = {
    id: 4,
    title: "ASCII (қосымша материалдар)",
    course_id: 2,
    level: 0,
    number: 4,
    description: description,
    content: content
};