import { Lecture } from "../../../types";

const description = `
Ендеше, Scratch. Бұл визуалды бағдарламалау тілі және оның негізгі командалары туралы
сізге дәрісте айтылды. Scratch сайтында тіркелгеннен кейін бағдарламалауды онлайн
бастай аласыз. Қазіргі уақытта Scratch ішінара қазақшаға аударылған деп айту қиын,
алайда кейбір тілдерге толық аударылмаған. Мысалы, анықтамалық әзірге тек ағылшын тілінде қолжетімді.
`;

const content = `
# Scratch-қа көшеміз

Ендеше, Scratch. Бұл визуалды бағдарламалау тілі және оның негізгі командалары туралы сізге дәрісте айтылды.

Scratch бағдарламасын өзіңіз байқап көру үшін https://scratch.mit.edu/ сілтемесіне өтіп, «Присоединиться» батырмасын басыңыз. Тіркелгеннен кейін бағдарламалауды онлайн бастай аласыз. Қазіргі уақытта Scratch көптеген тілдерге аударылған, бірақ толық емес. Мысалы, анықтамалық әзірге тек ағылшын тілінде қолжетімді.

Қаласаңыз, ойнап көре аласыз, сондай-ақ дәрісте көрсетілген студенттік жобалардың кодын қарап шығуға болады.  
Міне Pikachu Pastry Catch: https://scratch.mit.edu/projects/26329354/  
Немесе қоқысты әртүрлі контейнерлерге сұрыптау жобасы: https://scratch.mit.edu/projects/71161586/

Дэвид және оның командасы сізден алаңдамауды сұрайды, егер сізге мұндай күрделі жобаларды әзірге жасай алмайтындай көрінсе: олардың деңгейі шынында да бағдарламалау бойынша белгілі бір тәжірибе мен дағдыны талап етеді.
`;

export const lecture_00_06: Lecture = {
    id: 5,
    title: "Scratch-қа көшеміз",
    course_id: 2,
    level: 0,
    number: 6,
    description: description,
    content: content
};