import { Lecture } from "../../../types";

const description = `
Алғашқы тапсырманы орындайтын уақыт келді, және біз оны Scratch тілінде жасаймыз!
Тапсырманың мәні — қызықты уақыт өткізіп қана қоймай, сонымен бірге нөлден бастап
шағын жоба жасау. Бұл анимация, ойын немесе интерактивті жоба болуы мүмкін — таңдау өзіңізде!
`;

const content = `
# Тапсырма

1. Scratch-та болып жатқан процестерді жақсырақ түсіну үшін бірнеше жобаның бастапқы кодын мына жерден жүктеуге болады: https://scratch.mit.edu/explore/projects/all/. Оларды іске қосып көріңіз, зерттеңіз. Басқа адамдардың кодын оқу өте пайдалы. Бұл — өзіңіз әлі жасай алмайтын бағдарламалардың ішінде не бар екенін түсінудің ең жақсы тәсілдерінің бірі. Осы қосымшалардың қалай жұмыс істейтінін түсіне бастағанда, келесі қадамға сенімді түрде өте аласыз.

2. Енді өзіңіз бір нәрсе жасайтын уақыт келді. Тапсырманың мәні — қызықты уақыт өткізіп қана қоймай, сонымен бірге нөлден бастап шағын жоба жасау. Бұл анимация, ойын немесе интерактивті әрекет болуы мүмкін.

## Жобаға қойылатын талаптар

* Бағдарламада кемінде **екі спрайт** (кейіпкер немесе сурет) болуы керек, әрі **олардың кем дегенде біреуі мысық болмауы тиіс =)**.  
* Кемінде **үш скрипт** (әрекет) болуы керек.  
* Кемінде **бір шарт, бір цикл және бір айнымалы** қолданылуы керек.  
* Бағдарламаға **кемінде бір дыбыс** енгізілуі керек.

Яғни сіздің жобаңыз дәрісте жазылған мысалдардан күрделірек, бірақ Пикачу мен қоқыс жинау туралы көрсетілген ойындардан қарапайымырақ болады. Бұл тапсырманы орындау үшін сіз Scratch кодын құрайтын бірнеше ондаған пазл-блоктарды қолданатын шығарсыз.

Егер бір нәрсе шықпай жатса, мәселені шешу тәсілін өзгертіп көрген жөн шығар. Ең бастысы: **қорықпай әрекет етіңіз!** Келесі дәрісте, егер бейнедәрістен кейін бір нәрсені ұмытып қалсаңыз, Scratch бағдарламасының негізгі командалары бойынша қысқаша нұсқаулық таба аласыз.
`;

export const lecture_00_08: Lecture = {
    id: 7,
    title: "Тапсырма",
    course_id: 2,
    level: 0,
    number: 8,
    description: description,
    content: content
};